-- MySQL dump 10.13  Distrib 8.0.43, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: store_management
-- ------------------------------------------------------
-- Server version	8.0.43

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Dumping data for table `categories`
--
USE store_management;
LOCK TABLES `categories` WRITE;
/*!40000 ALTER TABLE `categories` DISABLE KEYS */;
INSERT INTO `categories` VALUES (1,'Đồ uống'),(2,'Bánh kẹo'),(3,'Gia vị'),(4,'Đồ gia dụng'),(5,'Mỹ phẩm');
/*!40000 ALTER TABLE `categories` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `customers`
--

LOCK TABLES `customers` WRITE;
/*!40000 ALTER TABLE `customers` DISABLE KEYS */;
-- password: 123456 (BCrypt hash giống user)
INSERT INTO `customers` VALUES 
(0,'Khách vãng lai',null,null,null,null,'2025-10-08 12:20:48'),
(1,'Khách hàng 1','0909000001','kh1@mail.com','$2a$11$blVO.EMh9OUxIvmnemek4.tgcv6BZkkCmyRo6Au7guZSUSIwH/foK','Địa chỉ 1','2025-10-08 12:20:48'),
(2,'Khách hàng 2','0909000002','kh2@mail.com','$2a$11$blVO.EMh9OUxIvmnemek4.tgcv6BZkkCmyRo6Au7guZSUSIwH/foK','Địa chỉ 2','2025-10-08 12:20:48'),
(3,'Khách hàng 3','0909000003','kh3@mail.com','$2a$11$blVO.EMh9OUxIvmnemek4.tgcv6BZkkCmyRo6Au7guZSUSIwH/foK','Địa chỉ 3','2025-10-08 12:20:48'),
(4,'Khách hàng 4','0909000004','kh4@mail.com','$2a$11$blVO.EMh9OUxIvmnemek4.tgcv6BZkkCmyRo6Au7guZSUSIwH/foK','Địa chỉ 4','2025-10-08 12:20:48'),
(5,'Khách hàng 5','0909000005','kh5@mail.com','$2a$11$blVO.EMh9OUxIvmnemek4.tgcv6BZkkCmyRo6Au7guZSUSIwH/foK','Địa chỉ 5','2025-10-08 12:20:48'),
(6,'Khách hàng 6','0909000006','kh6@mail.com','$2a$11$blVO.EMh9OUxIvmnemek4.tgcv6BZkkCmyRo6Au7guZSUSIwH/foK','Địa chỉ 6','2025-10-08 12:20:48'),
(7,'Khách hàng 7','0909000007','kh7@mail.com','$2a$11$blVO.EMh9OUxIvmnemek4.tgcv6BZkkCmyRo6Au7guZSUSIwH/foK','Địa chỉ 7','2025-10-08 12:20:48'),
(8,'Khách hàng 8','0909000008','kh8@mail.com','$2a$11$blVO.EMh9OUxIvmnemek4.tgcv6BZkkCmyRo6Au7guZSUSIwH/foK','Địa chỉ 8','2025-10-08 12:20:48'),
(9,'Khách hàng 9','0909000009','kh9@mail.com','$2a$11$blVO.EMh9OUxIvmnemek4.tgcv6BZkkCmyRo6Au7guZSUSIwH/foK','Địa chỉ 9','2025-10-08 12:20:48'),
(10,'Khách hàng 10','0909000010','kh10@mail.com','$2a$11$blVO.EMh9OUxIvmnemek4.tgcv6BZkkCmyRo6Au7guZSUSIwH/foK','Địa chỉ 10','2025-10-08 12:20:48'),
(11,'Khách hàng 11','0909000011','kh11@mail.com','$2a$11$blVO.EMh9OUxIvmnemek4.tgcv6BZkkCmyRo6Au7guZSUSIwH/foK','Địa chỉ 11','2025-10-08 12:20:48'),
(12,'Khách hàng 12','0909000012','kh12@mail.com','$2a$11$blVO.EMh9OUxIvmnemek4.tgcv6BZkkCmyRo6Au7guZSUSIwH/foK','Địa chỉ 12','2025-10-08 12:20:48'),
(13,'Khách hàng 13','0909000013','kh13@mail.com','$2a$11$blVO.EMh9OUxIvmnemek4.tgcv6BZkkCmyRo6Au7guZSUSIwH/foK','Địa chỉ 13','2025-10-08 12:20:48'),
(14,'Khách hàng 14','0909000014','kh14@mail.com','$2a$11$blVO.EMh9OUxIvmnemek4.tgcv6BZkkCmyRo6Au7guZSUSIwH/foK','Địa chỉ 14','2025-10-08 12:20:48'),
(15,'Khách hàng 15','0909000015','kh15@mail.com','$2a$11$blVO.EMh9OUxIvmnemek4.tgcv6BZkkCmyRo6Au7guZSUSIwH/foK','Địa chỉ 15','2025-10-08 12:20:48'),
(16,'Khách hàng 16','0909000016','kh16@mail.com','$2a$11$blVO.EMh9OUxIvmnemek4.tgcv6BZkkCmyRo6Au7guZSUSIwH/foK','Địa chỉ 16','2025-10-08 12:20:48'),
(17,'Khách hàng 17','0909000017','kh17@mail.com','$2a$11$blVO.EMh9OUxIvmnemek4.tgcv6BZkkCmyRo6Au7guZSUSIwH/foK','Địa chỉ 17','2025-10-08 12:20:48'),
(18,'Khách hàng 18','0909000018','kh18@mail.com','$2a$11$blVO.EMh9OUxIvmnemek4.tgcv6BZkkCmyRo6Au7guZSUSIwH/foK','Địa chỉ 18','2025-10-08 12:20:48'),
(19,'Khách hàng 19','0909000019','kh19@mail.com','$2a$11$blVO.EMh9OUxIvmnemek4.tgcv6BZkkCmyRo6Au7guZSUSIwH/foK','Địa chỉ 19','2025-10-08 12:20:48'),
(20,'Khách hàng 20','0909000020','kh20@mail.com','$2a$11$blVO.EMh9OUxIvmnemek4.tgcv6BZkkCmyRo6Au7guZSUSIwH/foK','Địa chỉ 20','2025-10-08 12:20:48');
/*!40000 ALTER TABLE `customers` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `inventory`
--

LOCK TABLES `inventory` WRITE;
/*!40000 ALTER TABLE `inventory` DISABLE KEYS */;
INSERT INTO `inventory` VALUES (1,1,25,'2025-10-08 12:20:48'),(2,2,169,'2025-10-08 12:20:48'),(3,3,77,'2025-10-08 12:20:48'),(4,4,169,'2025-10-08 12:20:48'),(5,5,90,'2025-10-08 12:20:48'),(6,6,105,'2025-10-08 12:20:48'),(7,7,125,'2025-10-08 12:20:48'),(8,8,37,'2025-10-08 12:20:48'),(9,9,74,'2025-10-08 12:20:48'),(10,10,149,'2025-10-08 12:20:48'),(11,11,69,'2025-10-08 12:20:48'),(12,12,23,'2025-10-08 12:20:48'),(13,13,46,'2025-10-08 12:20:48'),(14,14,144,'2025-10-08 12:20:48'),(15,15,134,'2025-10-08 12:20:48'),(16,16,182,'2025-10-08 12:20:48'),(17,17,99,'2025-10-08 12:20:48'),(18,18,72,'2025-10-08 12:20:48'),(19,19,128,'2025-10-08 12:20:48'),(20,20,123,'2025-10-08 12:20:48'),(21,21,155,'2025-10-08 12:20:48'),(22,22,78,'2025-10-08 12:20:48'),(23,23,166,'2025-10-08 12:20:48'),(24,24,117,'2025-10-08 12:20:48'),(25,25,168,'2025-10-08 12:20:48'),(26,26,197,'2025-10-08 12:20:48'),(27,27,36,'2025-10-08 12:20:48'),(28,28,145,'2025-10-08 12:20:48'),(29,29,61,'2025-10-08 12:20:48'),(30,30,139,'2025-10-08 12:20:48'),(31,31,47,'2025-10-08 12:20:48'),(32,32,154,'2025-10-08 12:20:48'),(33,33,194,'2025-10-08 12:20:48'),(34,34,41,'2025-10-08 12:20:48'),(35,35,154,'2025-10-08 12:20:48'),(36,36,71,'2025-10-08 12:20:48'),(37,37,49,'2025-10-08 12:20:48'),(38,38,165,'2025-10-08 12:20:48'),(39,39,73,'2025-10-08 12:20:48'),(40,40,176,'2025-10-08 12:20:48'),(41,41,41,'2025-10-08 12:20:48'),(42,42,34,'2025-10-08 12:20:48'),(43,43,175,'2025-10-08 12:20:48'),(44,44,59,'2025-10-08 12:20:48'),(45,45,198,'2025-10-08 12:20:48'),(46,46,106,'2025-10-08 12:20:48'),(47,47,99,'2025-10-08 12:20:48'),(48,48,55,'2025-10-08 12:20:48'),(49,49,62,'2025-10-08 12:20:48'),(50,50,33,'2025-10-08 12:20:48');
/*!40000 ALTER TABLE `inventory` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `order_items`
--

LOCK TABLES `order_items` WRITE;
/*!40000 ALTER TABLE `order_items` DISABLE KEYS */;
INSERT INTO `order_items` VALUES (1,1,23,2,31265.00,62530.00),(2,1,5,2,205683.00,411366.00),(3,1,47,1,477948.00,477948.00),(4,1,25,2,170243.00,340486.00),(5,2,39,1,447059.00,447059.00),(6,2,14,1,51108.00,51108.00),(7,2,46,3,411147.00,1233441.00),(8,3,18,3,202167.00,606501.00),(9,3,34,1,44219.00,44219.00),(10,3,26,3,23354.00,70062.00),(11,4,24,2,10843.00,21686.00),(12,5,9,1,94180.00,94180.00),(13,6,18,3,186886.00,560658.00),(14,6,22,2,199267.00,398534.00),(15,6,42,3,215726.00,647178.00),(16,6,17,3,474268.00,1422804.00),(17,6,20,3,286499.00,859497.00),(18,7,8,2,256297.00,512594.00),(19,8,42,1,355116.00,355116.00),(20,8,43,2,129224.00,258448.00),(21,8,31,3,367155.00,1101465.00),(22,9,17,2,48755.00,97510.00),(23,9,12,2,381904.00,763808.00),(24,9,43,2,167445.00,334890.00),(25,9,19,3,429281.00,1287843.00),(26,10,25,1,232635.00,232635.00),(27,10,1,2,245362.00,490724.00),(28,10,23,2,127233.00,254466.00),(29,10,49,2,46207.00,92414.00),(30,11,3,2,347879.00,695758.00),(31,11,23,3,130215.00,390645.00),(32,11,4,1,64761.00,64761.00),(33,11,33,1,240159.00,240159.00),(34,11,7,1,141418.00,141418.00),(35,12,40,2,455428.00,910856.00),(36,12,46,2,75412.00,150824.00),(37,12,34,2,189856.00,379712.00),(38,12,25,3,114654.00,343962.00),(39,13,24,2,143251.00,286502.00),(40,13,23,2,381347.00,762694.00),(41,13,18,2,179146.00,358292.00),(42,13,9,2,90394.00,180788.00),(43,14,24,2,327016.00,654032.00),(44,14,2,1,403478.00,403478.00),(45,14,27,3,404474.00,1213422.00),(46,14,4,2,312582.00,625164.00),(47,15,18,1,105328.00,105328.00),(48,15,27,2,17303.00,34606.00),(49,15,50,2,23033.00,46066.00),(50,16,15,1,43160.00,43160.00),(51,16,16,2,18541.00,37082.00),(52,16,44,1,492698.00,492698.00),(53,16,41,1,451150.00,451150.00),(54,17,42,1,467148.00,467148.00),(55,18,30,1,64334.00,64334.00),(56,18,11,1,178454.00,178454.00),(57,18,20,3,50518.00,151554.00),(58,19,16,1,89280.00,89280.00),(59,19,23,3,404655.00,1213965.00),(60,19,11,2,331196.00,662392.00),(61,20,49,1,367325.00,367325.00),(62,20,32,2,264392.00,528784.00),(63,20,19,3,345903.00,1037709.00),(64,20,17,2,392028.00,784056.00),(65,20,19,1,171939.00,171939.00),(66,21,11,3,227666.00,682998.00),(67,21,25,2,436122.00,872244.00),(68,21,48,1,340400.00,340400.00),(69,21,10,2,58482.00,116964.00),(70,21,4,2,137900.00,275800.00),(71,22,40,2,165504.00,331008.00),(72,23,1,2,296698.00,593396.00),(73,23,16,3,384657.00,1153971.00),(74,23,40,3,135828.00,407484.00),(75,24,3,3,379562.00,1138686.00),(76,25,9,1,22063.00,22063.00),(77,25,16,2,185892.00,371784.00),(78,26,47,2,130329.00,260658.00),(79,27,37,1,448581.00,448581.00),(80,27,23,1,484618.00,484618.00),(81,28,20,3,357837.00,1073511.00),(82,28,34,1,161219.00,161219.00),(83,28,1,3,458131.00,1374393.00),(84,29,28,1,485514.00,485514.00),(85,29,7,3,487044.00,1461132.00),(86,29,42,1,235885.00,235885.00),(87,29,38,1,223761.00,223761.00),(88,30,25,1,426943.00,426943.00),(89,30,11,3,130209.00,390627.00),(90,30,5,2,73116.00,146232.00),(91,30,46,2,272220.00,544440.00),(92,30,23,3,467964.00,1403892.00);
/*!40000 ALTER TABLE `order_items` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `orders`
--

LOCK TABLES `orders` WRITE;
/*!40000 ALTER TABLE `orders` DISABLE KEYS */;
INSERT INTO `orders` VALUES (1,5,3,5,'2025-10-08 12:20:48','paid',1292330.00,100000.00),(2,17,3,NULL,'2025-10-08 12:20:48','paid',1731608.00,0.00),(3,8,3,NULL,'2025-10-08 12:20:48','paid',720782.00,0.00),(4,20,3,5,'2025-10-08 12:20:48','paid',21686.00,21686.00),(5,1,2,NULL,'2025-10-08 12:20:48','paid',94180.00,0.00),(6,5,3,2,'2025-10-08 12:20:48','paid',3888671.00,100000.00),(7,9,3,4,'2025-10-08 12:20:48','paid',512594.00,102518.80),(8,11,3,3,'2025-10-08 12:20:48','paid',1715029.00,171502.90),(9,11,3,NULL,'2025-10-08 12:20:48','paid',2484051.00,0.00),(10,11,3,2,'2025-10-08 12:20:48','paid',1070239.00,100000.00),(11,20,3,NULL,'2025-10-08 12:20:48','paid',1532741.00,0.00),(12,10,2,NULL,'2025-10-08 12:20:48','paid',1785354.00,0.00),(13,10,3,2,'2025-10-08 12:20:48','paid',1588276.00,100000.00),(14,6,2,2,'2025-10-08 12:20:48','paid',2896096.00,50000.00),(15,10,2,3,'2025-10-08 12:20:48','paid',186000.00,27900.00),(16,10,2,5,'2025-10-08 12:20:48','paid',1024090.00,50000.00),(17,19,3,NULL,'2025-10-08 12:20:48','paid',467148.00,0.00),(18,10,2,NULL,'2025-10-08 12:20:48','paid',394342.00,0.00),(19,8,3,4,'2025-10-08 12:20:48','paid',1965637.00,294845.55),(20,3,3,NULL,'2025-10-08 12:20:48','paid',2889813.00,0.00),(21,9,2,NULL,'2025-10-08 12:20:48','paid',2288406.00,0.00),(22,17,3,NULL,'2025-10-08 12:20:48','paid',331008.00,0.00),(23,6,3,1,'2025-10-08 12:20:48','paid',2154851.00,323227.65),(24,1,3,1,'2025-10-08 12:20:48','paid',1138686.00,170802.90),(25,2,2,5,'2025-10-08 12:20:48','paid',393847.00,100000.00),(26,15,3,1,'2025-10-08 12:20:48','paid',260658.00,52131.60),(27,4,2,NULL,'2025-10-08 12:20:48','paid',933199.00,0.00),(28,16,2,NULL,'2025-10-08 12:20:48','paid',2609123.00,0.00),(29,4,3,4,'2025-10-08 12:20:48','paid',2406292.00,481258.40),(30,1,3,NULL,'2025-10-08 12:20:48','paid',2912134.00,0.00);
/*!40000 ALTER TABLE `orders` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `payments`
--

LOCK TABLES `payments` WRITE;
/*!40000 ALTER TABLE `payments` DISABLE KEYS */;
INSERT INTO `payments` VALUES (1,1,1192330.00,'cash','2025-10-08 12:20:48'),(2,2,1731608.00,'e-wallet','2025-10-08 12:20:48'),(3,3,720782.00,'e-wallet','2025-10-08 12:20:48'),(4,4,0.00,'card','2025-10-08 12:20:48'),(5,5,94180.00,'cash','2025-10-08 12:20:48'),(6,6,3788671.00,'cash','2025-10-08 12:20:48'),(7,7,410075.20,'e-wallet','2025-10-08 12:20:48'),(8,8,1543526.10,'cash','2025-10-08 12:20:48'),(9,9,2484051.00,'cash','2025-10-08 12:20:48'),(10,10,970239.00,'card','2025-10-08 12:20:48'),(11,11,1532741.00,'e-wallet','2025-10-08 12:20:48'),(12,12,1785354.00,'card','2025-10-08 12:20:48'),(13,13,1488276.00,'card','2025-10-08 12:20:48'),(14,14,2846096.00,'cash','2025-10-08 12:20:48'),(15,15,158100.00,'card','2025-10-08 12:20:48'),(16,16,974090.00,'cash','2025-10-08 12:20:48'),(17,17,467148.00,'cash','2025-10-08 12:20:48'),(18,18,394342.00,'e-wallet','2025-10-08 12:20:48'),(19,19,1670791.45,'card','2025-10-08 12:20:48'),(20,20,2889813.00,'card','2025-10-08 12:20:48'),(21,21,2288406.00,'cash','2025-10-08 12:20:48'),(22,22,331008.00,'e-wallet','2025-10-08 12:20:48'),(23,23,1831623.35,'cash','2025-10-08 12:20:48'),(24,24,967883.10,'e-wallet','2025-10-08 12:20:48'),(25,25,293847.00,'cash','2025-10-08 12:20:48'),(26,26,208526.40,'cash','2025-10-08 12:20:48'),(27,27,933199.00,'cash','2025-10-08 12:20:48'),(28,28,2609123.00,'card','2025-10-08 12:20:48'),(29,29,1925033.60,'cash','2025-10-08 12:20:48'),(30,30,2912134.00,'card','2025-10-08 12:20:48');
/*!40000 ALTER TABLE `payments` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `permissions`
--

LOCK TABLES `permissions` WRITE;
/*!40000 ALTER TABLE `permissions` DISABLE KEYS */;
INSERT INTO `permissions` VALUES (1,'Xem thống kê doanh thu','dashboard_view','Xem báo cáo tổng quan về tình hình kinh doanh.'),(2,'Quản lý người dùng','user_manage','Tạo, sửa, xóa tài khoản nhân viên và phân quyền.'),(3,'Quản lý nhà cung cấp','supplier_manage','Thêm, sửa, xóa thông tin nhà cung cấp.'),(4,'Quản lý danh mục sản phẩm','category_manage','Quản lý các loại sản phẩm.'),(5,'Quản lý kho','inventory_manage','Nhập hàng, kiểm kê và quản lý số lượng tồn kho.'),(6,'Quản lý khuyến mãi','promotion_manage','Tạo và quản lý các chương trình giảm giá.'),(7,'Quản lý phân quyền','role_manage','Tạo và quản lý các nhóm quyền.'),(8,'Quản lý chức năng','permission_manage','Tạo và quản lý các chức năng.'),(9,'Quản lý khách hàng','customer_manage','Thêm, sửa, xóa, tìm kiếm thông tin khách hàng.'),(10,'Quản lý sản phẩm','product_manage','Quản lý thông tin sản phẩm và giá cả.'),(11,'Quản lý đơn hàng','order_manage','Tạo đơn hàng mới, thêm chi tiết hóa đơn và thanh toán.');
/*!40000 ALTER TABLE `permissions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `products`
--

LOCK TABLES `products` WRITE;
/*!40000 ALTER TABLE `products` DISABLE KEYS */;
INSERT INTO `products` VALUES (1,2,1,'Coca Cola lon','8900000000001',314838.00,'hộp','2025-10-08 12:20:48'),(2,1,3,'Pepsi lon','8900000000002',114807.00,'cái','2025-10-08 12:20:48'),(3,3,3,'Trà Xanh 0 độ','8900000000003',415725.00,'tuýp','2025-10-08 12:20:48'),(4,2,1,'Sting dâu','8900000000004',351670.00,'cái','2025-10-08 12:20:48'),(5,3,2,'Red Bull','8900000000005',402179.00,'lon','2025-10-08 12:20:48'),(6,2,2,'Bánh Oreo','8900000000006',209283.00,'chai','2025-10-08 12:20:48'),(7,5,3,'Bánh Chocopie','8900000000007',212528.00,'lon','2025-10-08 12:20:48'),(8,1,2,'Kẹo Alpenliebe','8900000000008',34313.00,'lon','2025-10-08 12:20:48'),(9,5,1,'Kẹo bạc hà','8900000000009',316289.00,'cái','2025-10-08 12:20:48'),(10,1,2,'Socola KitKat','8900000000010',139959.00,'chai','2025-10-08 12:20:48'),(11,5,1,'Nước mắm Nam Ngư','8900000000011',51792.00,'chai','2025-10-08 12:20:48'),(12,2,2,'Nước tương Maggi','8900000000012',462539.00,'lon','2025-10-08 12:20:48'),(13,5,3,'Muối i-ốt','8900000000013',173302.00,'cái','2025-10-08 12:20:48'),(14,1,1,'Bột ngọt Ajinomoto','8900000000014',443069.00,'cái','2025-10-08 12:20:48'),(15,2,2,'Dầu ăn Tường An','8900000000015',281354.00,'tuýp','2025-10-08 12:20:48'),(16,2,1,'Nồi cơm điện','8900000000016',405347.00,'hộp','2025-10-08 12:20:48'),(17,1,3,'Ấm siêu tốc','8900000000017',113087.00,'chai','2025-10-08 12:20:48'),(18,3,2,'Quạt máy','8900000000018',69968.00,'hộp','2025-10-08 12:20:48'),(19,4,1,'Bếp gas mini','8900000000019',416845.00,'lon','2025-10-08 12:20:48'),(20,3,3,'Máy xay sinh tố','8900000000020',334564.00,'hộp','2025-10-08 12:20:48'),(21,1,1,'Sữa rửa mặt Hazeline','8900000000021',188475.00,'lon','2025-10-08 12:20:48'),(22,4,1,'Kem dưỡng da Pond\'s','8900000000022',413840.00,'hộp','2025-10-08 12:20:48'),(23,3,3,'Dầu gội Sunsilk','8900000000023',158950.00,'tuýp','2025-10-08 12:20:48'),(24,4,2,'Sữa tắm Dove','8900000000024',336928.00,'chai','2025-10-08 12:20:48'),(25,1,1,'Nước hoa Romano','8900000000025',352508.00,'cái','2025-10-08 12:20:48'),(26,1,1,'Cà phê G7','8900000000026',201228.00,'lon','2025-10-08 12:20:48'),(27,2,1,'Trà Lipton','8900000000027',38039.00,'cái','2025-10-08 12:20:48'),(28,2,3,'Sữa Vinamilk','8900000000028',252845.00,'chai','2025-10-08 12:20:48'),(29,3,1,'Sữa TH True Milk','8900000000029',35278.00,'hộp','2025-10-08 12:20:48'),(30,3,2,'Nước suối Lavie','8900000000030',331637.00,'lon','2025-10-08 12:20:48'),(31,5,3,'Khăn giấy Tempo','8900000000031',102525.00,'chai','2025-10-08 12:20:48'),(32,4,3,'Giấy vệ sinh Pulppy','8900000000032',495429.00,'chai','2025-10-08 12:20:48'),(33,3,2,'Bình nước Lock&Lock','8900000000033',354771.00,'gói','2025-10-08 12:20:48'),(34,2,1,'Hộp nhựa Tupperware','8900000000034',297415.00,'cái','2025-10-08 12:20:48'),(35,1,3,'Dao Inox','8900000000035',47523.00,'hộp','2025-10-08 12:20:48'),(36,3,1,'Bàn chải Colgate','8900000000036',136417.00,'chai','2025-10-08 12:20:48'),(37,2,2,'Kem đánh răng P/S','8900000000037',93713.00,'hộp','2025-10-08 12:20:48'),(38,2,3,'Nước súc miệng Listerine','8900000000038',223906.00,'gói','2025-10-08 12:20:48'),(39,1,2,'Bông tẩy trang','8900000000039',317819.00,'tuýp','2025-10-08 12:20:48'),(40,4,1,'Khẩu trang 3M','8900000000040',464252.00,'gói','2025-10-08 12:20:48'),(41,3,1,'Bánh mì sandwich','8900000000041',279350.00,'cái','2025-10-08 12:20:48'),(42,5,2,'Mì gói Hảo Hảo','8900000000042',9413.00,'hộp','2025-10-08 12:20:48'),(43,1,2,'Mì Omachi','8900000000043',26616.00,'hộp','2025-10-08 12:20:48'),(44,5,2,'Bún khô','8900000000044',350911.00,'gói','2025-10-08 12:20:48'),(45,3,1,'Phở ăn liền','8900000000045',407779.00,'tuýp','2025-10-08 12:20:48'),(46,1,1,'Nước ngọt Sprite','8900000000046',230083.00,'hộp','2025-10-08 12:20:48'),(47,1,3,'Trà sữa đóng chai','8900000000047',15130.00,'cái','2025-10-08 12:20:48'),(48,3,3,'Snack Oishi','8900000000048',43415.00,'cái','2025-10-08 12:20:48'),(49,4,2,'Snack Lay\'s','8900000000049',83536.00,'tuýp','2025-10-08 12:20:48'),(50,1,2,'Kẹo dẻo Haribo','8900000000050',328680.00,'cái','2025-10-08 12:20:48');
/*!40000 ALTER TABLE `products` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `promotions`
--

LOCK TABLES `promotions` WRITE;
/*!40000 ALTER TABLE `promotions` DISABLE KEYS */;
INSERT INTO `promotions` VALUES (1,'SALE10','Giảm 10% cho mọi đơn hàng','percent',10.00,'2025-01-01','2025-12-31',0.00,0,0,'active'),(2,'FREESHIP50K','Giảm 50,000 cho đơn từ 300,000 trở lên','fixed',50000.00,'2025-03-01','2025-12-31',300000.00,500,0,'active'),(3,'NEWUSER','Giảm 20% cho khách hàng mới','percent',20.00,'2025-01-01','2025-06-30',0.00,1,0,'active'),(4,'SUMMER15','Giảm 15% mùa hè','percent',15.00,'2025-06-01','2025-08-31',50000.00,1000,0,'active'),(5,'VIP100K','Giảm 100,000 cho đơn từ 1 triệu','fixed',100000.00,'2025-01-01','2025-12-31',1000000.00,200,0,'active');
/*!40000 ALTER TABLE `promotions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `role_permissions`
--

LOCK TABLES `role_permissions` WRITE;
/*!40000 ALTER TABLE `role_permissions` DISABLE KEYS */;
INSERT INTO `role_permissions` VALUES (1,1),(1,2),(1,3),(1,4),(1,5),(1,6),(1,7),(1,8),(1,9),(2,9),(1,10),(2,10),(1,11),(2,11);
/*!40000 ALTER TABLE `role_permissions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `roles`
--

LOCK TABLES `roles` WRITE;
/*!40000 ALTER TABLE `roles` DISABLE KEYS */;
INSERT INTO `roles` VALUES (1,'Admin','Quản trị viên hệ thống, có toàn quyền truy cập.'),(2,'Staff','Nhân viên bán hàng, có quyền hạn giới hạn.');
/*!40000 ALTER TABLE `roles` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `suppliers`
--

LOCK TABLES `suppliers` WRITE;
/*!40000 ALTER TABLE `suppliers` DISABLE KEYS */;
INSERT INTO `suppliers` VALUES (1,'Công ty ABC','0909123456','abc@gmail.com','Hà Nội'),(2,'Công ty XYZ','0912123456','xyz@gmail.com','TP HCM'),(3,'Công ty 123','0933123456','123@gmail.com','Đà Nẵng');
/*!40000 ALTER TABLE `suppliers` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
-- pass 123456
INSERT INTO `users` VALUES (1,'admin','$2a$11$blVO.EMh9OUxIvmnemek4.tgcv6BZkkCmyRo6Au7guZSUSIwH/foK','Quản trị viên',1,'2025-10-08 12:20:48'),(2,'staff01','$2a$11$blVO.EMh9OUxIvmnemek4.tgcv6BZkkCmyRo6Au7guZSUSIwH/foK','Nguyễn Văn A',2,'2025-10-08 12:20:48'),(3,'staff02','$2a$11$blVO.EMh9OUxIvmnemek4.tgcv6BZkkCmyRo6Au7guZSUSIwH/foK','Lê Thị B',2,'2025-10-08 12:20:48');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `bills`
--

LOCK TABLES `bills` WRITE;
/*!40000 ALTER TABLE `bills` DISABLE KEYS */;
INSERT INTO `bills` VALUES 
(1,1,5,1292330.00,100000.00,1192330.00,'cash','paid','2025-10-08 12:20:48','2025-10-08 12:25:48'),
(2,2,17,1731608.00,0.00,1731608.00,'e-wallet','paid','2025-10-08 12:20:48','2025-10-08 12:26:48'),
(3,3,8,720782.00,0.00,720782.00,'e-wallet','paid','2025-10-08 12:20:48','2025-10-08 12:27:48'),
(4,6,5,3888671.00,100000.00,3788671.00,'cash','paid','2025-10-08 12:20:48','2025-10-08 12:28:48'),
(5,7,9,512594.00,102518.80,410075.20,'e-wallet','paid','2025-10-08 12:20:48','2025-10-08 12:29:48'),
(6,10,11,1070239.00,100000.00,970239.00,'card','paid','2025-10-08 12:20:48','2025-10-08 12:30:48'),
(7,14,6,2896096.00,50000.00,2846096.00,'cash','paid','2025-10-08 12:20:48','2025-10-08 12:31:48'),
(8,16,10,1024090.00,50000.00,974090.00,'cash','paid','2025-10-08 12:20:48','2025-10-08 12:32:48'),
(9,23,6,2154851.00,323227.65,1831623.35,'cash','paid','2025-10-08 12:20:48','2025-10-08 12:33:48'),
(10,25,2,393847.00,100000.00,293847.00,'cash','paid','2025-10-08 12:20:48','2025-10-08 12:34:48'),
(11,5,1,94180.00,0.00,94180.00,'cash','unpaid','2025-10-08 12:20:48',NULL),
(12,11,20,1532741.00,0.00,1532741.00,'e-wallet','unpaid','2025-10-08 12:20:48',NULL),
(13,15,10,186000.00,27900.00,158100.00,'card','paid','2025-10-08 12:20:48','2025-10-08 12:35:48');
/*!40000 ALTER TABLE `bills` ENABLE KEYS */;
UNLOCK TABLES;

-- Unlock all tables at the end
UNLOCK TABLES;

/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-10-08 19:25:34
